{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\nmodel_j.py\u00da\b<lambda>\u0018\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "function_type": "lambda", "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "nb_col": 5, "nb_filter": 24, "trainable": true, "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_2", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "nb_col": 5, "nb_filter": 36, "trainable": true, "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_3", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "nb_col": 5, "nb_filter": 48, "trainable": true, "subsample": [2, 2], "W_constraint": null, "nb_row": 5, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_4", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "nb_col": 3, "nb_filter": 64, "trainable": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_5", "activation": "linear", "b_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "nb_col": 3, "nb_filter": 64, "trainable": true, "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 1152, "b_constraint": null, "output_dim": 100, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": 100, "b_constraint": null, "output_dim": 50, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_3", "input_dim": 50, "b_constraint": null, "output_dim": 10, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"name": "dense_4", "input_dim": 10, "b_constraint": null, "output_dim": 1, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "bias": true, "init": "glorot_uniform"}}]}