{"class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "input_dtype": "float32", "cropping": [[65, 20], [0, 0]]}}, {"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>0\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_filter": 24, "W_constraint": null, "subsample": [2, 2], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_filter": 36, "W_constraint": null, "subsample": [2, 2], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_2"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_filter": 48, "W_constraint": null, "subsample": [2, 2], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "name": "convolution2d_3"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_filter": 64, "W_constraint": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_4"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "trainable": true, "nb_filter": 64, "W_constraint": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "output_dim": 100, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 4224, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "output_dim": 50, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 100, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "output_dim": 10, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 50, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "W_constraint": null, "output_dim": 1, "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "input_dim": 10, "name": "dense_4"}}], "keras_version": "1.2.1"}