{"keras_version": "1.2.1", "config": [{"config": {"name": "lambda_1", "trainable": true, "output_shape_type": "raw", "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "convolution2d_1", "nb_filter": 16, "subsample": [4, 4], "W_regularizer": null, "nb_row": 8, "border_mode": "same", "nb_col": 8, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 32, "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "border_mode": "same", "nb_col": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 64, "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "border_mode": "same", "nb_col": 5, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "output_dim": 512, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "input_dim": 12800, "name": "dense_1", "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "output_dim": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "input_dim": 512, "name": "dense_2", "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}