{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[65, 20], [0, 0]], "input_dtype": "float32", "trainable": true, "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_filter": 16, "b_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_col": 8, "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "nb_row": 8, "bias": true, "subsample": [4, 4]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_filter": 32, "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 512, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": 6400, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": 512, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}