{"keras_version": "1.2.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "cropping2d_1", "trainable": true, "cropping": [[65, 20], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>0\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 24, "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution2d_1", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 36, "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution2d_2", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 48, "subsample": [2, 2], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution2d_3", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution2d_4", "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution2d_5", "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 4224, "output_dim": 100, "name": "dense_1", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 100, "output_dim": 50, "name": "dense_2", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 50, "output_dim": 10, "name": "dense_3", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 10, "output_dim": 1, "name": "dense_4", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}