{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "cropping": [[65, 20], [0, 0]], "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "subsample": [4, 4], "b_constraint": null, "name": "convolution2d_1", "nb_filter": 16, "nb_col": 8, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "nb_row": 8, "bias": true, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_2", "nb_filter": 32, "nb_col": 5, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "nb_row": 5, "bias": true, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_3", "nb_filter": 64, "nb_col": 5, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "border_mode": "same", "nb_row": 5, "bias": true, "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "output_dim": 512, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": 6400, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "input_dim": 512, "bias": true}}]}